app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'R', "updated_at" = '2014-10-14 05:18:40.545456' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def add_tmdb
    if params[:moviesHash] != nil
      moviesArray = params[:moviesHash].keys
      moviesArray.each do |tmdb_id|
        Movie::create_from_tmdb(tmdb_id)